
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/tooruuetani/github-actions-trial/actions/runs/4081536325)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/4ba0c28b-e3c5-4590-9285-5caa449a6358/terraform-bin apply -auto-approve
data.aws_region.now: Reading...
data.aws_region.now: Read complete after 0s [id=ap-northeast-1]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=361139455558]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.31.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_vpc.main: Creating...
aws_vpc.main: Still creating... [10s elapsed]
aws_vpc.main: Creation complete after 14s [id=vpc-0c56fd15e10435e5c]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_region.now: Reading...%0Adata.aws_region.now: Read complete after 0s [id=ap-northeast-1]%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_caller_identity.current: Read complete after 0s [id=361139455558]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_vpc.main will be created%0A  + resource "aws_vpc" "main" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "172.31.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags_all                             = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0Aaws_vpc.main: Creating...%0Aaws_vpc.main: Still creating... [10s elapsed]%0Aaws_vpc.main: Creation complete after 14s [id=vpc-0c56fd15e10435e5c]%0A%0AApply complete! Resources: 1 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy-resource-for-dev","PRNumber":6,"Program":"tfcmt","SHA1":"68f019bce28c16331aa2cc7715bc6a48864ade3f","Vars":{},"WorkflowName":"Execute apply command to dev environment."} -->